Public Attributes | List of all members
API_AnalyticalSurfaceMember Struct Reference
Analytical Model
Describes a Structural Analytical Model Surface Member. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
API_AnalyticalMemberType  | analyticalMemberType
The type of the represented element.
API_Guid  | elemGuid
The unique identifier of the represented element.
API_AnalyticalSurface  | surface
The type of the surface.
GS::Array< API_AnalyticalCurve >  | contour
The contour as a list of Structural Analytical Model Curves.
GS::Array< GS::Array< API_AnalyticalCurve > >  | holeContours
The list of eventual holes as a list of hole contours.
GS::Array< API_AnalyticalNode >  | internalNodes
List of eventual Internal Nodes set on this Structural Analytical Model Curve Member.
double  | thickness
The structure thickness.
API_Vector3D  | lcsXVector
The X axis of the local coordinate system.
double  | ez
The structure eccentricity.
API_Vector3D  | ezVector
The structure eccentricity vector.
API_AttributeIndex  | materialAttrIndex
The material attribute index that references the material in the system.
API_AttributeIndex  | layerAttrIndex
The containing layer's attribute index.
API_Analytical2DFEMType  | FEMType
The FEM type of the surface member.
API_Guid  | groupId
The unique identifier of the group containing the element.
Detailed Description
Describes a Structural Analytical Model Surface Member.
Since
Archicad 25
Member Data Documentation
◆ analyticalMemberType
 API_AnalyticalSurfaceMember::analyticalMemberType
The type of the represented element.
◆ contour
 API_AnalyticalSurfaceMember::contour
The contour as a list of Structural Analytical Model Curves.
◆ elemGuid
 API_AnalyticalSurfaceMember::elemGuid
The unique identifier of the represented element.
◆ ez
 API_AnalyticalSurfaceMember::ez
The structure eccentricity.
◆ ezVector
 API_AnalyticalSurfaceMember::ezVector
The structure eccentricity vector.
◆ FEMType
 API_AnalyticalSurfaceMember::FEMType
The FEM type of the surface member.
◆ groupId
 API_AnalyticalSurfaceMember::groupId
The unique identifier of the group containing the element.
◆ holeContours
 API_AnalyticalSurfaceMember::holeContours
The list of eventual holes as a list of hole contours.
◆ internalNodes
 API_AnalyticalSurfaceMember::internalNodes
List of eventual Internal Nodes set on this Structural Analytical Model Curve Member.
◆ layerAttrIndex
 API_AnalyticalSurfaceMember::layerAttrIndex
The containing layer's attribute index.
◆ lcsXVector
 API_AnalyticalSurfaceMember::lcsXVector
The X axis of the local coordinate system.
◆ materialAttrIndex
 API_AnalyticalSurfaceMember::materialAttrIndex
The material attribute index that references the material in the system.
◆ surface
 API_AnalyticalSurfaceMember::surface
The type of the surface.
◆ thickness
 API_AnalyticalSurfaceMember::thickness
The structure thickness.